# MPG Cars

# Assign each to a to a variable called cars1 and cars2
-data 
    - cars1.csv and cars2.csv

In [1]:
import pandas as pd
import numpy as np

In [23]:
cars1=pd.read_csv("cars1.csv")
cars2=pd.read_csv("cars2.csv")
cars1.head(5)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN,NaN
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN,NaN
4,17.0,8,302,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN,NaN

In [4]:
cars2.head(5)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,33.0,4,91,53,1795,17.4,76,3,honda civic
1,20.0,6,225,100,3651,17.7,76,1,dodge aspen se
2,18.0,6,250,78,3574,21.0,76,1,ford granada ghia
3,18.5,6,250,110,3645,16.2,76,1,pontiac ventura sj
4,17.5,6,258,95,3193,17.8,76,1,amc pacer d/l

#  fix cars1 having some unnamed blanks ie: take only the column except unnamed

In [24]:
cars1.drop(columns=['Unnamed: 9','Unnamed: 10','Unnamed: 11','Unnamed: 12','Unnamed: 13'], inplace=True)
cars1.head(5)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

 # What is the number of observations in each dataset?

In [25]:
len(cars1)

198

In [27]:
cars1.shape

(198, 9)

In [28]:
cars2.shape

(200, 9)

In [26]:
len(cars2)

200

# Join cars1 and cars2 into a single DataFrame called cars

In [30]:
cars=pd.concat([cars1,cars2])

In [31]:
cars.head(5)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

In [32]:
cars.shape

(398, 9)

#  Create a random number Series from 15,000 to 73,000. as owners

In [35]:
from numpy import random

x=random.randint(15000,73000, size=(398))

print(x)
print(type(x))

[17573 51780 42255 34464 71389 18476 32016 63620 45458 38892 17699 46686
 33230 25022 22948 48379 56236 20001 22288 23714 52516 58622 70194 20967
 35771 24936 60896 46642 43104 48278 58725 69068 52698 39740 65538 33815
 58758 53210 47100 45146 63662 16285 15091 41778 23633 18448 20084 21250
 71047 19927 67941 68654 63145 20995 58443 29351 50164 38119 51791 24723
 38374 30799 49355 31441 43017 65704 35969 65358 68144 46447 62735 69868
 46646 56028 23529 19574 51068 42820 61118 47864 48602 67608 29026 46138
 62868 35672 28681 35250 19383 33810 18621 32065 22612 41123 50985 30821
 67107 61749 47161 32647 39904 64429 20464 40451 48570 22352 20017 66210
 32793 39191 24387 48346 34259 62057 40436 19863 70477 70226 17500 50705
 24308 46567 19518 38135 35896 70399 49705 33780 23047 49015 38913 23190
 46757 50953 61758 33937 57361 19328 35586 43992 46196 52382 21356 41826
 20867 54522 30922 21816 65564 55061 26732 38248 66229 58420 24396 23841
 30734 67859 34476 67114 21561 31786 41674 31766 67719 32980 56099 28432
 31627 65995 63602 29023 72527 30178 57074 19672 60330 23479 56508 51206
 25139 35497 54350 59521 48650 31568 56702 32835 57592 27516 49584 63121
 51923 16331 62847 47569 37093 38721 19185 23576 17500 40652 33774 49610
 66649 19541 70878 46874 60048 29168 27629 46212 69498 61311 31008 47370
 42542 44576 71184 37135 33575 23003 55694 53127 54520 29246 68606 40278
 57681 20848 57574 40430 53640 33002 53610 16576 34530 60603 27392 44047
 30576 50033 25253 72997 19722 46323 21620 16269 28503 30106 24070 48475
 19532 17386 49920 23246 38375 72370 45676 34089 26262 36122 46910 70587
 49185 19907 48519 43909 35894 28347 48239 67894 40748 67209 54419 24938
 40810 37435 46464 68748 18468 31100 31028 44115 53554 55588 59534 36649
 18786 28536 44812 59879 24414 66415 29299 49069 67027 69254 17179 29969
 30564 26499 43988 53344 41277 49076 69255 47732 68143 21672 54614 33886
 63591 61151 61276 17077 51201 44037 51463 53767 39412 63381 61383 57233
 21919 64965 15374 17380 45296 34636 65172 69720 56336 58475 39323 41546
 21444 29800 65959 68782 30989 22914 71492 27512 60552 51582 40643 16098
 18507 20993 29921 69438 63811 65459 64639 51747 64902 46591 23670 25025
 36402 60975 54507 29708 57954 70433 51329 32149 25868 37228 64171 62601
 29996 45481 18703 45894 54319 41883 24238 37857 36123 37016 29767 20627
 67183 59473 21943 69047 24524 68034 58742 39213 19190 59982 54612 17190
 32722 62856]
<class 'numpy.ndarray'>

# Add the column owners to cars

In [36]:
cars["owners"]=x

In [37]:
cars

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,17573
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,51780
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,42255
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,34464
4,17.0,8,302,140,3449,10.5,70,1,ford torino,71389
...,...,...,...,...,...,...,...,...,...,...
195,27.0,4,140,86,2790,15.6,82,1,ford mustang gl,59982
196,44.0,4,97,52,2130,24.6,82,2,vw pickup,54612
197,32.0,4,135,84,2295,11.6,82,1,dodge rampage,17190
198,28.0,4,120,79,2625,18.6,82,1,ford ranger,32722
199,31.0,4,119,82,2720,19.4,82,1,chevy s-10,62856

 # Fictitious Names

In [38]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

In [56]:
data1 = pd.DataFrame(raw_data_1, columns = ['subject_id', 'first_name', 'last_name'])
data2 = pd.DataFrame(raw_data_2, columns = ['subject_id', 'first_name', 'last_name'])
data3 = pd.DataFrame(raw_data_3, columns = ['subject_id','test_id'])

data3

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

#  Join the two dataframes along rows and assign all_data

In [46]:
all_data=pd.concat([data1,data2],axis=0)

In [47]:
all_data.head(10)

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

# Join the two dataframes along columns and assing to all_data_col

In [48]:
all_data_col=pd.concat([data1,data2],axis=1)

In [49]:
all_data_col.head(5)

  subject_id first_name last_name subject_id first_name last_name
0          1       Alex  Anderson          4      Billy    Bonder
1          2        Amy  Ackerman          5      Brian     Black
2          3      Allen       Ali          6       Bran   Balwner
3          4      Alice      Aoni          7      Bryce     Brice
4          5     Ayoung   Atiches          8      Betty    Btisan

# Merge all_data and data3 along the subject_id value

In [50]:
merge1=pd.merge(all_data,data3,on="subject_id")

In [51]:
merge1.head(5)

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Amy  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          4      Billy    Bonder       61

# Merge only the data that has the same 'subject_id' on both data1 and data2

In [57]:
mer=pd.merge(data1,data2,on="subject_id",how="inner")

In [58]:
mer

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black

# Merge all values in data1 and data2, with matching records from both sides where available.

In [61]:
mer2=pd.merge(data1,data2,on="subject_id",how="outer")

In [62]:
mer2

  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Amy    Ackerman          NaN         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          5       Ayoung     Atiches        Brian       Black
5          6          NaN         NaN         Bran     Balwner
6          7          NaN         NaN        Bryce       Brice
7          8          NaN         NaN        Betty      Btisan